DataProcessors/ФССП_ЗагрузкаРегионов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>ФССП_ЗагрузкаРегионов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПролонгации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ФССП_ЗагрузкаРегионов/Ext/ObjectModule.bsl
Процедура ЗагрузитьДанные(ПолеИсходнойТаблицы, ОтправлятьСообщенияОбОшибке) Экспорт
	ИмяСправочникаПриставов = бит_ФССП_Переопределяемый.ПолучитьИмяСправочникаСудебныеПриставы();
	ИмяСправочникаССП = бит_ФССП_Переопределяемый.ПолучитьИмяСправочникаСлужбыСудебныхПриставов();
	ТаблицаРегионовОСП = ПоискПапкиРегионаОСП();
	ТаблицаРегионовПристав = ПоискПапкиРегионаПристав();	
	
	
	Для НомерСтроки = 2 По ПолеИсходнойТаблицы.ВысотаТаблицы Цикл
		КодРегионаЗнач = ПолеИсходнойТаблицы.Область("R" + Формат(НомерСтроки, "ЧГ=") + "C" + Формат(ЭтотОбъект.ID, "ЧГ=")).Текст;
		НаименованиеРегионаЗнач = ПолеИсходнойТаблицы.Область("R" + Формат(НомерСтроки, "ЧГ=") + "C" + Формат(ЭтотОбъект.IDЗайма, "ЧГ=")).Текст;
		Если ЗначениеЗаполнено(КодРегионаЗнач) И ЗначениеЗаполнено(НаименованиеРегионаЗнач) Тогда
			РегионПапкаССП = ТаблицаРегионовОСП.Найти(Число(КодРегионаЗнач));
			РегионПапкаПристав = ТаблицаРегионовПристав.Найти(Число(КодРегионаЗнач));
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(КодРегионаЗнач) И ЗначениеЗаполнено(НаименованиеРегионаЗнач) И РегионПапкаПристав = Неопределено Тогда
			РегионГруппаОбъект = Справочники[ИмяСправочникаПриставов].СоздатьГруппу();
			РегионГруппаОбъект.Наименование = НаименованиеРегионаЗнач;
			РегионГруппаОбъект.КодРегиона = КодРегионаЗнач;
			РегионГруппаОбъект.Записать();
			РегионГруппаОбъект = РегионГруппаОбъект.Ссылка;
		КонецЕсли;
		Если ЗначениеЗаполнено(КодРегионаЗнач) И ЗначениеЗаполнено(НаименованиеРегионаЗнач) и РегионПапкаССП = Неопределено Тогда
			РегионГруппаОбъект = Справочники[ИмяСправочникаССП].СоздатьГруппу();
			РегионГруппаОбъект.Наименование = НаименованиеРегионаЗнач;
			РегионГруппаОбъект.КодРегиона = КодРегионаЗнач;
			РегионГруппаОбъект.Записать();
			РегионГруппаОбъект = РегионГруппаОбъект.Ссылка;	
			
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Процедура ЗаполнитьНомераСтолбцов() Экспорт
	ЭтотОбъект.ID = 1;
	ЭтотОбъект.IDЗайма = 2;
	ЭтотОбъект.ДатаВремя = 4;
	ЭтотОбъект.НомерПролонгации = 3;
	ЭтотОбъект.КоличествоДней = 5;
	ЭтотОбъект.СуммаПлатежа = 6;
КонецПроцедуры

Функция ПоискПапкиРегионаОСП()
	ИмяСправочникаССП = бит_ФССП_Переопределяемый.ПолучитьИмяСправочникаСлужбыСудебныхПриставов();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаСправочникаПриставов.Ссылка КАК Ссылка,
	               |	ТаблицаСправочникаПриставов.КодРегиона КАК КодРегиона,
	               |	ТаблицаСправочникаПриставов.Наименование КАК Наименование
	               |ИЗ
	               |	&ТаблицаСправочникаПриставов Как ТаблицаСправочникаПриставов
	               |ГДЕ
	               |	ТаблицаСправочникаПриставов.ЭтоГруппа = ИСТИНА
	               |	И ТаблицаСправочникаПриставов.ПометкаУдаления = ЛОЖЬ";
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ТаблицаСправочникаПриставов","Справочник."+ИмяСправочникаССП);
	
	
	
	
	//Запрос.УстановитьПараметр("КодРегиона",Число(НомерРегиона));
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат; 	
КонецФункции	

Функция ПоискПапкиРегионаПристав()
	ИмяСправочникаПриставов = бит_ФССП_Переопределяемый.ПолучитьИмяСправочникаСудебныеПриставы();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаСправочникаССП.Ссылка КАК Ссылка,
	               |	ТаблицаСправочникаССП.КодРегиона КАК КодРегиона,
	               |	ТаблицаСправочникаССП.Наименование КАК Наименование
	               |ИЗ
	               |	&ТаблицаСправочникаССП Как ТаблицаСправочникаССП
	               |ГДЕ
	               |	ТаблицаСправочникаССП.ЭтоГруппа = ИСТИНА
	               |	И ТаблицаСправочникаССП.ПометкаУдаления = ЛОЖЬ";
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ТаблицаСправочникаССП","Справочник."+ИмяСправочникаПриставов);
	
	//Запрос.УстановитьПараметр("КодРегиона",Число(НомерРегиона));
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат; 	
КонецФункции
